tap "sdkman/tap"
tap "oven-sh/bun"
tap "manaflow-ai/cmux"

cask "helium-browser"
cask "google-chrome"
cask "brave-browser"

# cask "zen"

# cask "alt-tab"
cask "spotify"
cask "notion"
cask "obsidian"
# cask "notion-calendar"
cask "raycast"
cask "rectangle"
# cask "todoist-app"

cask "zoom" if ENV['HOMEBREW_BUNDLE_INSTALL_ZOOM']
cask "legcord"

cask "stats"
cask "onyx"
cask "omnidisksweeper"
cask "keyboardcleantool"
cask "pearcleaner"
# if OS.mac? && MacOS.version >= :tahoe
# cask "jordanbaird-ice@beta"
# else
# cask "jordanbaird-ice"
# end
cask "thaw" # updated version of ice
cask "karabiner-elements"
cask "cloudflare-warp"
brew "dockutil"
cask "ente-auth"

if ENV['HOMEBREW_BUNDLE_INSTALL_BITWARDEN']
  if OS.mac?
    brew "mas"
    mas "Bitwarden", id: 1352778147
  else
    cask "bitwarden"
  end
end

cask "ghostty"
cask "cmux"
cask "sublime-merge"
cask "visual-studio-code"
cask "antigravity"
cask "zed"
# cask "intellij-idea"
# cask "jetbrains-toolbox"
cask "yaak"
brew "gemini-cli"
brew "lazygit"

cask "font-cascadia-code"
cask "font-commit-mono"
cask "font-noto-sans-mono"
cask "font-ubuntu-mono"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
brew "gh"
brew "git"
brew "sdkman/tap/sdkman-cli"

brew "go"
brew "python@3.13"

brew "pnpm"
# brew "yarn"
brew "fnm"
brew "oven-sh/bun/bun"
brew "deno"

brew "virtualenv"
